app/controllers/galleries_controller.rb

SELECT "galleries".* FROM "galleries"
---
  def index
    if current_user== @showcase.gallery.user || current_user.level >100
      @galleries = Gallery.all

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    @gallery = User.find(params[:user_id]).gallery

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @gallery = Gallery.find(params[:id])

INSERT INTO "galleries" ("created_at", "description", "id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 24 Aug 2014 05:02:13 UTC +00:00], ["description", "No gallery"], ["id", 2], ["updated_at", Sun, 24 Aug 2014 05:02:13 UTC +00:00], ["user_id", nil]]
---
  def create

    if (gallery_params[:user])== nil
      gallery_params[:user] = @user
    end


    @gallery = Gallery.new(gallery_params)

    respond_to do |format|
      if @gallery.save

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def update
    @gallery = Gallery.find(params[:id])

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "galleries" WHERE "galleries"."id" = $1  [["id", 2]]
---
  def destroy
    if current_user.level >100

      @gallery = Gallery.find(params[:id])
      @gallery.destroy