app/controllers/showcases_controller.rb

  def index
    @showcases = Showcase.all
---
SELECT "showcases".* FROM "showcases"

  def create
    @showcase = Showcase.new(showcase_params)

    respond_to do |format|
      if @showcase.save
---
INSERT INTO "showcases" ("canvas_content_type", "canvas_file_name", "canvas_file_size", "canvas_updated_at", "created_at", "description", "gallery_id", "likes", "updated_at", "upload_date", "visits") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"