app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)



    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "crypted_password", "email", "remember_me_token", "remember_me_token_expires_at", "reset_password_email_sent_at", "reset_password_token", "reset_password_token_expires_at", "salt", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "avatar_file_name" = 'images.jpeg', "avatar_content_type" = 'image/jpeg', "avatar_file_size" = 13668, "avatar_updated_at" = '2014-08-19 15:43:04.508390', "salt" = 'DAaAbR3omLcGdSDLFi79', "crypted_password" = '$2a$10$dGW8pqkoLdAWgwZl3npp5.Phjyp5Ji.cNEBsJ4ZPYyPgpFtZ/8xBa', "updated_at" = '2014-08-19 15:43:05.240975' WHERE "users"."id" = 1